/*
 * Виконав Кобук Назар, ІО-81, варіант 13
 * 
 * Середній наробіток до відмови Tср
 * γ-відсотковий наробіток на відмову Tγ при γ = 0.75,
 * ймовірність безвідмовної роботи на час 44 годин
 * інтенсивність відмов на час 801 годин
 */

using Lab1;

var rejectionRates = new List<int>
{
    25, 80, 157, 39, 372, 45, 108, 549, 1771,
    969, 508, 1134, 90, 382, 413, 444, 329, 158,
    551, 536, 216, 337, 493, 12, 1, 514, 88, 243,
    56, 521, 231, 301, 1120, 528, 513, 95, 79,
    460, 41, 383, 223, 39, 51, 625, 346, 11, 26,
    645, 377, 169, 88, 396, 126, 269, 962, 38,
    850, 2, 80, 73, 65, 253, 180, 80, 553, 150,
    808, 412, 384, 199, 640, 688, 613, 70, 227,
    481, 238, 253, 207, 879, 182, 670, 146, 453,
    502, 206, 94, 7, 28, 17, 31, 34, 136, 659,
    209, 143, 652, 119, 115, 259
};

var gamma = 0.75;
var hoursForFaultless = 44;
var hoursForIntensity = 801;

var labWork = new LabWork
{
    RejectionRates = rejectionRates,
    Gamma = gamma,
    HoursForFaultless = hoursForFaultless,
    HoursForIntensity = hoursForIntensity,
};

labWork.Calculate();